
                                    1. wire ( провідник / дріт )
// пов'язує шини між собою
// ! - не може зберірігати данні
 
asssign // зв'язує шини
-------------------
wire a // провідник a
asssign a = b; // пов'язує a та b, робить ці виходи однаковими
assign a = ~b; // пов'язує a та b, робить ці виходи комплементарними
[=]
wire a = b;
-------------------
wire [3:0]c; // оголошення 4 дротів: c[3], c[2], c[1], c[0] - шини с
wire [3:0] e;   // якщо e також 4-бітна шина
asssign e = c; // з'єднання шин e та c

assign c[1] = e[3]


-----------------------------------------------------------------------

                                    2. reg ( регістр ) ( flip-flop )
// пов'язує шини між собою
// ! - може зберірігати данні
-------------------
reg [3:0] m; // 4 bit регістр [m] | m {[m3] [m2] [m1] [m0]}
reg [0:31] int_a; // 32 bit регістр [int_a] | int_a {[int_a0] [int_a1] ... [int_a31]}
// ! - через нестандартний запис [0:31] / [31:0]

int_a = c; // asssign не треба


-----------------------------------------------------------------------
 3. integer = reg [0:31] ( об'явлення 32 bit регістру)
-----------------------------------------------------------------------
                                EXAMPLES [1]

reg [7:0] m1 [0:15] // масив пам'яті [m1] з 16 слів по 8 біт кожне
m1[0][1:0] // взяти біти 1..0 слова №0
m1[0][0] // взяти 0 біт слова №0
---

wire[12:0]s = 12; // 32 bit decimal numeric 12, it'll cut only to 13 bit 
wire[12:0]z = 13'd12; // 13 bit decimal numeric 12 [13'd] (num) - [13'd](12)

wire[3:0]x = 4'b0101 // 4 bit binary numeric
wire[7:0]y = 8'hA5 // 8 bit hexadecimal/hex numeric
