/*
1. Реалізувати модуль cntSignal, який підраховує кількість одиниць на чотирьох входах та видає результат у двійковому коді.

| X1 | X2 | X3 | X4 | Y | Y2 | Y1 | Y0 |
| -- | -- | -- | -- | - | -- | -- | -- |
| 0  | 0  | 0  | 0  | 0 | 0  | 0  | 0  | 
| 0  | 0  | 0  | 1  | 1 | 0  | 0  | 1  | 0010₂ => Y = 1 -> 001₂
| 0  | 0  | 1  | 0  | 1 | 0  | 0  | 1  |
| 0  | 0  | 1  | 1  | 2 | 0  | 1  | 0  | 0011₂ => Y = 2 -> 010₂
| 0  | 1  | 0  | 0  | 1 | 0  | 0  | 1  |
| 0  | 1  | 0  | 1  | 2 | 0  | 1  | 0  |
| 0  | 1  | 1  | 0  | 2 | 0  | 1  | 0  |
| 0  | 1  | 1  | 1  | 3 | 0  | 1  | 1  |
| 1  | 0  | 0  | 0  | 1 | 0  | 0  | 1  |
| 1  | 0  | 0  | 1  | 2 | 0  | 1  | 0  |
| 1  | 0  | 1  | 0  | 2 | 0  | 1  | 0  |
| 1  | 0  | 1  | 1  | 3 | 0  | 1  | 1  |
| 1  | 1  | 0  | 0  | 2 | 0  | 1  | 0  |
| 1  | 1  | 0  | 1  | 3 | 0  | 1  | 1  |
| 1  | 1  | 1  | 0  | 3 | 0  | 1  | 1  |
| 1  | 1  | 1  | 1  | 4 | 1  | 0  | 0  |
*/

module cntSignal(
    input x1, input x2, input x3, input x4,
    output y2, output y1, output y0
);

assign {y2, y1, y0} = x1 + x2 + x3 + x4; // sum of input in binary form

endmodule